Repository: MONOPTICAL/MONOSCRIPT
Catalog: docs/lib/l10n/app_*.arb
Languages: ru

# navOverview
source: Overview
ru: Обзор

# navGetStarted
source: Get Started
ru: Начать

# navDocs
source: Docs
ru: Документация

# navCommunity
source: Community
ru: Сообщество

# navBlog
source: Blog
ru: Блог

# welcomeTitle
source: The MONOSCRIPT Programming Language
ru: Язык программирования MONOSCRIPT

# betaVersion
source: 0.1 Beta
ru: 0.1 Бета

# welcomeSlogan
source: "Secure, readable plugin language: Kubernetes, security, automation scripts"
ru: "Безопасный, читаемый язык плагинов: Kubernetes, безопасность, автоматизация"

# downloadButtonLabel
source: Download for Linux
ru: Скачать для Linux

# codeExamplesTitle
source: Code Examples
ru: Примеры кода

# codeExamplesDescription
source: Explore different aspects of MONOscript through these practical examples. Select one to see the code and its output.
ru: Изучайте различные аспекты MONOscript с помощью этих практических примеров. Выберите пример, чтобы увидеть код и результат.

# byLabel
source: By
ru: От

# exampleFibonacci
source: Fibonacci
ru: Фибоначчи

# exampleFibonacciDesc
source: Classic Fibonacci number calculation algorithm
ru: Классический алгоритм вычисления чисел Фибоначчи

# exampleHelloWorld
source: Hello World
ru: Привет, мир

# exampleHelloWorldDesc
source: Simple text output example
ru: Пример простого вывода текста

# exampleSort
source: Sort
ru: Сортировка

# exampleSortDesc
source: Implementation of bubble sort algorithm
ru: Реализация алгоритма пузырьковой сортировки

# exampleGeneralCode
source: General Code
ru: Общий код

# exampleGeneralCodeDesc
source: Example of string manipulation and type conversion
ru: Пример работы со строками и преобразования типов

# exampleModules
source: Modules
ru: Модули

# exampleModulesDesc
source: Example of module usage
ru: Пример использования модулей

# outputTitle
source: Output
ru: Вывод

source: No example selected
ru: Пример не выбран

# executionTime
source: Execution time: {time} ms
ru: Время выполнения: {time} мс

# outputSortBefore
source: Before sort: [5, 3, 1, 4, 2]
ru: До сортировки: [5, 3, 1, 4, 2]

# outputSortAfter
source: After sort: [1, 2, 3, 4, 5]
ru: После сортировки: [1, 2, 3, 4, 5]

# outputGeneralCodeExit
source: [main exited with code 4]
ru: [main завершился с кодом 4]

# outputModulesResult
source: Sum: 15, Mul: 50
ru: Сумма: 15, Произведение: 50

# outputModulesExit
source: [moduleTest exited with code 0]
ru: [moduleTest завершился с кодом 0]

# outputDefaultExit
source: Program exited with code 0
ru: Программа завершилась с кодом 0

# codeFeaturesTitle
source: Code Features
ru: Возможности кода

# featureRecursionTitle
source: Recursion
ru: Рекурсия

# featureRecursionDesc
source: Function calls itself to calculate Fibonacci sequence
ru: Функция вызывает саму себя для вычисления последовательности Фибоначчи

# featureTypeCastingTitle
source: Type Casting
ru: Приведение типов

# featureTypeCastingDesc
source: Explicit casting using the "->" operator (n - 1->i64)
ru: Явное приведение с помощью оператора "->" (n - 1->i64)

# featurePureAnnotationTitle
source: @pure Annotation
ru: Аннотация @pure

# featurePureAnnotationDesc
source: Functions marked as pure have no side effects
ru: Функции, помеченные как pure, не имеют побочных эффектов

# featureStrictAnnotationTitle
source: @strict Annotation
ru: Аннотация @strict

# featureStrictAnnotationDesc
source: Ensures stricter type checking and memory safety
ru: Обеспечивает более строгую проверку типов и безопасность памяти

# featureEntryPointTitle
source: Entry Point Declaration
ru: Объявление точки входа

# featureEntryPointDesc
source: @entry annotation marks the program's entry point
ru: Аннотация @entry отмечает точку входа программы

# featureVoidReturnTypeTitle
source: void Return Type
ru: Тип возвращаемого значения void

# featureVoidReturnTypeDesc
source: Function doesn't return any value
ru: Функция не возвращает значение

# featureEchoStatementTitle
source: Echo Statement
ru: Оператор echo

# featureEchoStatementDesc
source: Built-in echo function for console output
ru: Встроенная функция echo для вывода в консоль

# featureStringLiteralsTitle
source: String Literals
ru: Строковые литералы

# featureStringLiteralsDesc
source: Direct usage of string literals with double quotes
ru: Прямое использование строковых литералов в двойных кавычках

# featureArrayManipulationTitle
source: Array Manipulation
ru: Работа с массивами

# featureArrayManipulationDesc
source: Creating and manipulating typed arrays (array<i32>)
ru: Создание и работа с типизированными массивами (array<i32>)

# featureForInLoopTitle
source: For-in Loop
ru: Цикл for-in

# featureForInLoopDesc
source: Iterating over ranges using for-in syntax
ru: Итерация по диапазонам с помощью синтаксиса for-in

# featureInitAssignTitle
source: Initialize-Assign Operator
ru: Оператор инициализации-присваивания

# featureInitAssignDesc
source: Uses ^= to initialize variables with their first value
ru: Использует ^= для инициализации переменных их первым значением

# featureArrayIndexingTitle
source: Array Indexing
ru: Индексация массива

# featureArrayIndexingDesc
source: Direct access to array elements with [] notation
ru: Прямой доступ к элементам массива с помощью []

# featureStringConcatTitle
source: String Concatenation
ru: Конкатенация строк

# featureStringConcatDesc
source: Joining strings with "+" operator
ru: Объединение строк с помощью оператора "+"

# featureBooleanOpsTitle
source: Boolean Operations
ru: Булевы операции

# featureBooleanOpsDesc
source: Complex boolean conditions with comparison operators
ru: Сложные булевы условия с операторами сравнения

# featureTypeConversionTitle
source: Type Conversion
ru: Преобразование типов

# featureTypeConversionDesc
source: Converting between data types using toString_int()
ru: Преобразование между типами данных с помощью toString_int()

# featureMultipleFunctionsTitle
source: Multiple Functions
ru: Несколько функций

# featureMultipleFunctionsDesc
source: Code organization with helper functions
ru: Организация кода с помощью вспомогательных функций

# featureModuleDeclTitle
source: Module Declaration
ru: Объявление модуля

# featureModuleDeclDesc
source: Using "use" keyword to import modules
ru: Использование ключевого слова "use" для импорта модулей

# featureFinalVarsTitle
source: Final Variables
ru: Финальные переменные

# featureFinalVarsDesc
source: Using "final" for constant values
ru: Использование "final" для константных значений

# featureModuleTestingTitle
source: Module Testing
ru: Тестирование модулей

# featureModuleTestingDesc
source: Testing module functions in a separate file
ru: Тестирование функций модуля в отдельном файле

# overviewSectionTitle
source: MONOSCRIPT Language: Overview
ru: Язык MONOSCRIPT: Обзор

# overviewSectionDesc
source: MONOSCRIPT is a fast, intuitive programming language designed for secure code execution in various environments.
ru: MONOSCRIPT — это быстрый, интуитивно понятный язык программирования, созданный для безопасного выполнения кода в различных средах.

# performanceTitle
source: High Performance
ru: Высокая производительность

# performanceDesc
source: Thanks to LLVM Backend, compiler written in C++ and standard library written in D and Zig, MONOSCRIPT provides optimal execution speed.
ru: Благодаря LLVM Backend, компилятору на C++ и стандартной библиотеке на D и Zig, MONOSCRIPT обеспечивает оптимальную скорость выполнения.

# securityTitle
source: Secure Execution
ru: Безопасное выполнение

# securityDesc
source: Created with an emphasis on code execution security in various environments, including Kubernetes and containers.
ru: Создан с упором на безопасность выполнения кода в различных средах, включая Kubernetes и контейнеры.

# paradigmsTitle
source: Supported Paradigms
ru: Поддерживаемые парадигмы

# paradigmImperative
source: Imperative
ru: Императивная

# paradigmImperativeDesc
source: Traditional constructs: if, for, while, mutability, and step-by-step execution
ru: Традиционные конструкции: if, for, while, изменяемость и пошаговое выполнение

# paradigmFunctional
source: Functional
ru: Функциональная

# paradigmFunctionalDesc
source: Lambdas, pure functions, pattern matching
ru: Лямбды, чистые функции, сопоставление с образцом

# paradigmModular
source: Modular
ru: Модульная

# paradigmModularDesc
source: Organization using use, modules and namespaces
ru: Организация с помощью use, модулей и пространств имён

# paradigmStructural
source: Structural
ru: Структурная

# paradigmStructuralDesc
source: Custom structures with methods and encapsulation support
ru: Пользовательские структуры с методами и поддержкой инкапсуляции

# licenseSectionTitle
source: Open Source License
ru: Открытая лицензия

# licenseDescription
source: MONOscript is proudly licensed under the GNU Lesser General Public License v2.1, ensuring that the language remains free and open source.
ru: MONOscript распространяется под лицензией GNU Lesser General Public License v2.1, что гарантирует его свободу и открытость.

# benefitCollabTitle
source: Community Collaboration
ru: Совместная работа сообщества

# benefitCollabDesc
source: Join a growing community of developers who contribute to and improve the language
ru: Присоединяйтесь к растущему сообществу разработчиков, которые вносят вклад и улучшают язык

# benefitIntegrationTitle
source: Commercial Integration
ru: Коммерческая интеграция

# benefitIntegrationDesc
source: Use MONOscript in proprietary software while keeping your code private
ru: Используйте MONOscript в проприетарном ПО, сохраняя свой код приватным

# benefitModifyTitle
source: Freedom to Modify
ru: Свобода модификации

# benefitModifyDesc
source: Adapt the language to your specific needs while sharing improvements
ru: Адаптируйте язык под свои нужды и делитесь улучшениями

# openSourceBelief
source: We believe in the power of open source software to drive innovation and create better technologies for everyone.
ru: Мы верим в силу открытого ПО для развития инноваций и создания лучших технологий для всех.

# roadmapSectionTitle
source: Project Roadmap
ru: Дорожная карта проекта

# roadmapStatus
source: Active Development
ru: Активная разработка

# roadmapDescription
source: MONOscript is rapidly evolving, with new features and improvements coming not just daily, but hourly. Our dedicated team is committed to making this language powerful, secure, and accessible.
ru: MONOscript быстро развивается: новые функции и улучшения появляются не только ежедневно, но и ежечасно. Наша команда стремится сделать язык мощным, безопасным и доступным.

# roadmapQ22025
source: Q2 2025
ru: 2 квартал 2025

# roadmapQ22025Milestone
source: First Beta Release
ru: Первый бета-релиз

# roadmapQ22025Status
source: Current
ru: Текущий

# roadmapQ32025
source: Q3 2025
ru: 3 квартал 2025

# roadmapQ32025Milestone
source: Ecosystem Extensions
ru: Расширения экосистемы

# roadmapQ32025Status
source: Planned
ru: Запланировано

# roadmapQ42025
source: Q4 2025
ru: 4 квартал 2025

# roadmapQ42025Milestone
source: Full IDE Support
ru: Полная поддержка IDE

# roadmapQ42025Status
source: Planned
ru: Запланировано

# roadmapQ12026
source: Q1 2026
ru: 1 квартал 2026

# roadmapQ12026Status
source: Planned
ru: Запланировано

# roadmapFeedback
source: Have suggestions for our roadmap? We actively incorporate community feedback into our development priorities.
ru: Есть предложения по дорожной карте? Мы активно учитываем обратную связь сообщества при определении приоритетов разработки.

# actionDocsTitle
source: Documentation
ru: Документация

# actionDocsDesc
source: You already hooked up with MONOscript? See the documentation!
ru: Уже знакомы с MONOscript? Ознакомьтесь с документацией!

# actionGetStartedTitle
source: Get Started
ru: Начать

# actionGetStartedDesc
source: New to MONOscript? Start your journey with our beginner guides!
ru: Впервые в MONOscript? Начните с наших руководств для новичков!

# actionContributeTitle
source: Contribute
ru: Внести вклад

# actionContributeDesc
source: Help us improve MONOscript by contributing to the project
ru: Помогите нам улучшить MONOscript, внося свой вклад в проект

# actionBlogTitle
source: Blog
ru: Блог

# actionBlogDesc
source: Read the latest news and articles about MONOscript
ru: Читайте последние новости и статьи о MONOscript

# actionWarning
source: Warning: using MONOscript may lead to uncontrollable urges to rewrite everything in a more secure way
ru: Внимание: использование MONOscript может вызвать непреодолимое желание переписать всё более безопасно

# footerSlogan
source: Secure, readable plugin language
ru: Безопасный, читаемый язык плагинов

# footerDocumentationTitle
source: Documentation
ru: Документация

# footerDocLink1
source: Language Reference
ru: Справочник языка

# footerDocLink2
source: Standard Library
ru: Стандартная библиотека

# footerDocLink3
source: Security
ru: Безопасность

# footerDocLink4
source: Installation
ru: Установка

# footerCommunityTitle
source: Community
ru: Сообщество

# footerCommunityLink4
source: Blog
ru: Блог

# footerResourcesTitle
source: Resources
ru: Ресурсы

# footerResourcesLink1
source: Tutorials
ru: Учебники

# footerResourcesLink2
source: Examples
ru: Примеры

# footerResourcesLink3
source: Use Cases
ru: Сценарии использования

# footerCopyright
source: Â© 2025 MONOPTICAL Corp. All rights reserved
ru: © 2025 MONOPTICAL Corp. Все права защищены

# tooltipWebsite
source: Website
ru: Сайт

# securityInMindText
source: Made with security in mind
ru: Создано с заботой о безопасности

# versionText
source: Version 0.1 Beta
ru: Версия 0.1 Бета
